tutorials/ancientStuff/solidMechanics/immersedTauFastenerElasticSolidFoam/demoTauFastener2/constant/rheologyProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      rheologyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress     no;

rheology
{
    type                    multiMaterial;

    laws
    (
        melt
        {
            type            linearElastic;
            rho             rho [1 -3 0 0 0 0 0] 7.8e3;
            E               E [1 -1 -2 0 0 0 0] 2e9;
            nu              nu [0 0 0 0 0 0 0] 0.3;
        }

        steel
        {
            type            linearElastic;
            rho             rho [1 -3 0 0 0 0 0] 7.8e3;
            E               E [1 -1 -2 0 0 0 0] 2e11;
            nu              nu [0 0 0 0 0 0 0] 0.3;
        }
		
		air
        {
            type            linearElastic;
            rho             rho [1 -3 0 0 0 0 0] 7.8e3;
            E               E [1 -1 -2 0 0 0 0] 2e7;
            nu              nu [0 0 0 0 0 0 0] 0.3;
        }
		
		//fastener
        //{
        //    type            linearElastic;
        //    rho             rho [1 -3 0 0 0 0 0] 7.8e3;
        //    E               E [1 -1 -2 0 0 0 0] 2e11;
        //    nu              nu [0 0 0 0 0 0 0] 0.3;
        //}
		
    );
}


// ************************************************************************* //
